benchmarks/annular_test/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel  constant;
nu              1e-06;
rho             1000;
