benchmarks/annular_test/0/epsilon
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.000765;

boundaryField
{
    innerWall
    {
        type            epsilonWallFunction;
        value           uniform 0.000765;
    }
    outerWall
    {
        type            epsilonWallFunction;
        value           uniform 0.000765;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
