benchmarks/annular_test/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    innerWall
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    outerWall
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
