benchmarks/annular_test/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    innerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
